// String
// Read-only property
const str1 = 'Александр';

str1[0] // A
str1[1] // л
str1[str1.length - 1] // р
//=============================================================
//? at method
// args: index
str1.at(0) // А
str1.at(1) // л
str1.at(-1) // р
//=============================================================
//? trim method
// Убирает пробелы c начала и с конца строки
/*
*Примечание:
Если строка имеет символы в начале или в конце,
То пробелы не будут убраны
*/
const str2 = '   Александр   '
str2.trim() // 'Александр'
//=============================================================
//? indexOf method
// args: Symbol
str1.indexOf('е') // 2
//=============================================================
//? includes method
// Выполняет поиск подстроки в строке
/*
*Примечание:
Не учитывает регистр
*/
str1.includes('Але') // true
//=============================================================
//? substring method
// args: start index : number, end index : number (end не включается в поиск подстроки)
const str3 = 'JavaScript';
str3.substring(0, 4) // Java
str3.substring(4) // Script

/*
*Примечание:
Принимает только числа
*/
str3.substring(4, str3.indexOf('t') + 1) // Script

/*
*Примечание:
Меняет индексы местами если start > end
*/
str3.substring(4, 0) // Java
//=============================================================
//? slice method
// args: start index : number, end index : number (end не включается в поиск подстроки)

/*
*Примечание:
Не меняет индексы местами если start > end
то возвращает пустую строку
*/
str3.slice(4, 0) // ''
str3.slice(0, 4) // Java

/*
*Примечание:
Если указан один аргумент то он воспринимается как количество символов
*/

// Symbol count == 6
str3.slice(-6) // Script

// Symbol starts from -6 to -3
str3.slice(-6, -3) // Scr
//=============================================================
//? replace && replaceAll method
const str4 = 'Я ничего не знаю';
str4.replace('ничего не', 'всё') // Я всё знаю
str4.replaceAll('н', '*') // Я *ичего *е з*аю
str4.replace(/н/g, '*') // Я *ичего *е з*аю

// g - global
// i - register
//=============================================================
//? split method
str4.split(' ') // [ "Я", "ничего", "не", "знаю" ]
